Revit 2027 API
IFCParameterTemplate.GetPropertySetApplicableEntities Method
Note: This API is now obsolete.
 Gets the list of IFC entities to which the property set is applicable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This is deprecated in Revit 2027 and will be removed in the next version of Revit.")]
public IList<string> GetPropertySetApplicableEntities(
	PropertySetupType propertySetupType,
	string propertySetName
)
<ObsoleteAttribute("This is deprecated in Revit 2027 and will be removed in the next version of Revit.")>
Public Function GetPropertySetApplicableEntities (
	propertySetupType As PropertySetupType,
	propertySetName As String
) As IList(Of String)
public:
[ObsoleteAttribute(L"This is deprecated in Revit 2027 and will be removed in the next version of Revit.")]
IList<String^>^ GetPropertySetApplicableEntities(
	PropertySetupType propertySetupType,
	String^ propertySetName
)
[<ObsoleteAttribute("This is deprecated in Revit 2027 and will be removed in the next version of Revit.")>]
member GetPropertySetApplicableEntities :
        propertySetupType : PropertySetupType *
        propertySetName : string -> IList<string>
Parameters
propertySetupType PropertySetupType
 The property setup type.
propertySetName String
 The property set name.
Return Value
IList<String>
 The list of IFC entities to which the property set is applicable.
Exceptions
Exception | Condition
ArgumentException |  A property set with the given name is not present in the template.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace